results/exp1/20260224T024240Z-vanilla-katran/raw/wrk/c8/run-1.txt
Running 1m test @ http://192.168.100.100:8080/exp1-1k.txt
  4 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    75.28us   13.61us   1.40ms   79.41%
    Req/Sec    26.24k     1.56k   29.12k    72.88%
  Latency Distribution
     50%   73.00us
     75%   80.00us
     90%   91.00us
     99%  118.00us
  6277618 requests in 1.00m, 7.44GB read
Requests/sec: 104453.90
Transfer/sec:    126.81MB